- Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd
df = pd.read_csv("https://gist.githubusercontent.com/fyyying/4aa5b471860321d7b47fd881898162b7/raw/6907bb3a38bfbb6fccf3a8b1edfb90e39714d14f/titanic_dataset.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
# Group the data by the "category" column and count the number of rows in each group
df.groupby("Age").size()

Age
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Length: 88, dtype: int64

In [7]:
df.sort_values(by="Fare")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C

- Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
Data0 = {"A":["Mohan","rohan","Sohan"],
       "B":[2,3,4],
       "Add":["Lko","PBH","Alld"]}

In [9]:
df2 = pd.DataFrame(Data0)

In [10]:
df2

       A  B   Add
0  Mohan  2   Lko
1  rohan  3   PBH
2  Sohan  4  Alld

In [11]:
df2['name_upper'] = df2['A'].str.upper()

print(df2)

       A  B   Add name_upper
0  Mohan  2   Lko      MOHAN
1  rohan  3   PBH      ROHAN
2  Sohan  4  Alld      SOHAN

In [12]:
df_subset = df2.loc[1:2, 'A']

print(df_subset)

1    rohan
2    Sohan
Name: A, dtype: object

In [13]:
type(df_subset)

pandas.core.series.Series

In [14]:
for index, row in df2.iterrows():

    print(row['A'], row['B'])

Mohan 2
rohan 3
Sohan 4

In [15]:
df_reindexed = df.iloc[::2].reset_index(drop=True)

In [16]:
data1 = {'A': [10, 20, 30],
        'B': [40, 50, 60],
        'C': [70, 80, 90]}

df3 = pd.DataFrame(data1)

In [17]:
df3

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [18]:
df3_reindex = df.iloc[1::3].reset_index(drop=True)

In [19]:
df3_reindex

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
2,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
3,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
4,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
292,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
293,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
294,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
295,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
296,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [20]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
df['Name'][0:10:2]

0                              Braund, Mr. Owen Harris
2                               Heikkinen, Miss. Laina
4                             Allen, Mr. William Henry
6                              McCarthy, Mr. Timothy J
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Name: Name, dtype: object

In [22]:
df[1:10:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [23]:
f = df['Name'][10:15]

In [24]:
s = df['Name'][0:5]

In [25]:
s

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [26]:
l = ['mohan','b','c','d','e']

In [27]:
pd.Series(s,index=l)

mohan    NaN
b        NaN
c        NaN
d        NaN
e        NaN
Name: Name, dtype: object

In [28]:
s1 = pd.Series(list(f),index=l)

In [29]:
s1

mohan         Sandstrom, Miss. Marguerite Rut
b                    Bonnell, Miss. Elizabeth
c              Saundercock, Mr. William Henry
d                 Andersson, Mr. Anders Johan
e        Vestrom, Miss. Hulda Amanda Adolfina
dtype: object

In [30]:
s1[0]

C:\Users\faraz\AppData\Local\Temp\ipykernel_21980\643609873.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[0]

'Sandstrom, Miss. Marguerite Rut'

In [31]:
s1['mohan']

'Sandstrom, Miss. Marguerite Rut'

In [32]:
s1

mohan         Sandstrom, Miss. Marguerite Rut
b                    Bonnell, Miss. Elizabeth
c              Saundercock, Mr. William Henry
d                 Andersson, Mr. Anders Johan
e        Vestrom, Miss. Hulda Amanda Adolfina
dtype: object

In [33]:
s2 = pd.concat([s1,s])

In [34]:
s2

mohan                      Sandstrom, Miss. Marguerite Rut
b                                 Bonnell, Miss. Elizabeth
c                           Saundercock, Mr. William Henry
d                              Andersson, Mr. Anders Johan
e                     Vestrom, Miss. Hulda Amanda Adolfina
0                                  Braund, Mr. Owen Harris
1        Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                   Heikkinen, Miss. Laina
3             Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                                 Allen, Mr. William Henry
dtype: object

In [35]:
s2['mohan']

'Sandstrom, Miss. Marguerite Rut'

In [36]:
s4 = pd.Series([2,3,4,5,6],index=[2,4,1,7,9])

In [37]:
s5 = pd.Series([34,47,38,54,63],index=[1,5,3,4,2])

In [38]:
s6 = pd.concat([s4,s5])

In [39]:
s6

2     2
4     3
1     4
7     5
9     6
1    34
5    47
3    38
4    54
2    63
dtype: int64

In [40]:
s6[0:5]

2    2
4    3
1    4
7    5
9    6
dtype: int64

In [41]:
s4

2    2
4    3
1    4
7    5
9    6
dtype: int64

In [42]:
s5

1    34
5    47
3    38
4    54
2    63
dtype: int64

In [43]:
s4*s5

1    136.0
2    126.0
3      NaN
4    162.0
5      NaN
7      NaN
9      NaN
dtype: float64

In [44]:
s4+s5

1    38.0
2    65.0
3     NaN
4    57.0
5     NaN
7     NaN
9     NaN
dtype: float64

In [55]:
data3 = pd.DataFrame({'key1':[1,2,3,4,5],
     'key2':[6,7,8,9,10],
     'key3':[10,3,5,3,2]
     })

In [51]:
data3

   key1  key2  key3
0     1     6    10
1     2     7     3
2     3     8     5
3     4     9     3
4     5    10     2

In [54]:
data4 = pd.DataFrame({'key1':[1,23,32,42,5],
     'key4':[63,7,8,91,10],
     'key5':[103,31,5,3,32]
     })

In [56]:
data4

   key1  key4  key5
0     1    63   103
1    23     7    31
2    32     8     5
3    42    91     3
4     5    10    32

In [57]:
pd.merge(data3,data4)

   key1  key2  key3  key4  key5
0     1     6    10    63   103
1     5    10     2    10    32

In [8]:
if __name__ == '__main__':
    n = int(input())
    
    for i in range(n):
        print(i*i)

0
1
4
9
16